#### BuiltInFailures.DetailFailures Members

---

|  |
| --- |
| BuiltInFailures DetailFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures DetailFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | EavesAreAligned | All eaves are already aligned. |
| Public property Static member | NeedsTwoToAlignEaves | At least two Slope Defining Lines are needed to perform Align Eaves. |
| Public property Static member | RepeatingDetailSpacingZeroError | Spacing must be greater than 0 |

# See Also

BuiltInFailures DetailFailures Class

Autodesk.Revit.DB Namespace